Revit 2027 API
TaskDialogCommonButtons Enumeration
A enumerated type containing the standard buttons available for Task Dialogs.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[FlagsAttribute]
public enum TaskDialogCommonButtons
<FlagsAttribute>
Public Enumeration TaskDialogCommonButtons
[FlagsAttribute]
public enum class TaskDialogCommonButtons
[<FlagsAttribute>]
type TaskDialogCommonButtons
Members
Member name | Value | Description
Cancel | 8 | Cancel button.
Close | 32 | Close button.
No | 4 | No button.
None | 0 | No common button.
Ok | 1 | OK button.
Retry | 16 | Retry button.
Yes | 2 | Yes button.
See Also
Reference
Autodesk.Revit.UI Namespace